package Lesson1;

public class Task1 {
    }
// 1. Создать в блокное код "public class main {
//    public static void main (String[] args) {
//        System.out.println("Hello world!!!");
//    }
// }
// 2. Изменить расширение txt na java.
// 3. Запустить консоль и выполнить команды javac and java
// E:\main\src>javac main.java
// E:\main\src>java main
// Hello world!!!
// E:\main\src>