package Lesson1;

public class Task4 {
}
// int це завжди ціле число, наприклад 1,43, 556
// Числа с плавающей точкой (или действительные числа) представлены типами float и double.
// Используются для хранения значений с точностью до определенного знака после десятичной точки.
//
//double — это числа с двойной точностью, максимально приближённые к заданным или полученным в результате вычислений значениям.
// Используется в Java для любых математических вычислений (квадратный корень, синус, косинус,..).
//
//float — менее точный тип с плавающей точкой. Используется очень редко с целью экономии памяти.
//
//Пример объявления типов с плавающей точкой:
//
//double d1 = 3.45;
//float f1 = 34.456f;
